// task3.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>

int main()
{
	std::cout<<"Enter the size masiv";
	int siz;
	std::cin >> siz;
	
	int** arr = new int* [siz];
	for (int i = 0; i < siz; i++)
		arr[i] = new int[siz];

	for (int row = 0; row < siz; row++)
		for (int colum = 0; colum < siz; colum++)
			arr[row][colum] = rand() % 100;

	for (int row = 0; row < siz; row++)
	{
		for (int colum = 0; colum < siz; colum++)
			std::cout << arr[row][colum]<<"\t";
		std::cout << "\n";
	}
	std::cout << "Transponder matrix" << "\n";
	for (int row = 0; row < siz; row++)
	{
		for (int colum = 0; colum < siz; colum++)
			std::cout << arr[colum][row] << "\t";
		std::cout << "\n";
	}
	for (int i=0; i<siz; i++)
		delete []arr[i];
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
